In [2]:
import pandas as pd

## Defining two data-frames
data_1 = pd.DataFrame({'id': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'x': range(7)})
data_2 = pd.DataFrame({'id': ['a', 'b', 'd'], 'y': range(3)})

################
## Inner join ##
################

data_inner = pd.merge(data_1, data_2, on = 'id', how = 'inner')
data_inner

  id  x  y
0  b  0  1
1  b  1  1
2  b  6  1
3  a  2  0
4  a  4  0
5  a  5  0

In [3]:
###############
## Left join ##
###############

data_left = pd.merge(data_1, data_2, on = 'id', how = 'left')
data_left

  id  x    y
0  b  0  1.0
1  b  1  1.0
2  a  2  0.0
3  c  3  NaN
4  a  4  0.0
5  a  5  0.0
6  b  6  1.0

In [4]:
################
## Right join ##
################

data_right = pd.merge(data_1, data_2, on = 'id', how = 'right')
data_right

  id    x  y
0  a  2.0  0
1  a  4.0  0
2  a  5.0  0
3  b  0.0  1
4  b  1.0  1
5  b  6.0  1
6  d  NaN  2

In [5]:
###################
## Data Stacking ##
###################

## Defining two data-frames
data_1 = pd.DataFrame({'id': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'x': range(7)})
data_2 = pd.DataFrame({'id': ['a', 'b', 'd'], 'x': range(3)})

data_combined = pd.concat([data_1, data_2], axis = 0)
data_combined

  id  x
0  b  0
1  b  1
2  a  2
3  c  3
4  a  4
5  a  5
6  b  6
0  a  0
1  b  1
2  d  2